Hi @MaxxLiu22 

Thanks for answer, i try your TF file and only works for "A" and 'NS" records but fail for "PTR" the only way i can get PTR is created is using a non dynamic list. im using a F100D with 'v6.2.12 build1319 (GA)' OS, the plugin version is '1.22.0' and im using your TF file:

`Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fortios_system_dnsdatabase.trname will be created
  + resource "fortios_system_dnsdatabase" "trname" {
      + authoritative           = "enable"
      + contact                 = "mathiias.gonzalez@gmail.com"
      + domain                  = "local.lann"
      + dynamic_sort_subtable   = "false"
      + forwarder               = "192.168.50.200"
      + forwarder6              = (known after apply)
      + get_all_tables          = "false"
      + id                      = (known after apply)
      + interface_select_method = (known after apply)
      + ip_master               = "0.0.0.0"
      + ip_primary              = (known after apply)
      + name                    = "2"
      + primary_name            = "dns"
      + rr_max                  = (known after apply)
      + source_ip               = "0.0.0.0"
      + source_ip6              = (known after apply)
      + status                  = "enable"
      + ttl                     = 86400
      + type                    = "primary"
      + vdomparam               = (known after apply)
      + view                    = "shadow"

      + dns_entry {
          + canonical_name = "ospcloudmh-kolla-controller-1"
          + hostname       = "ospcloudmh-kolla-controller-1"
          + id             = (known after apply)
          + ip             = "192.168.10.2"
          + ipv6           = (known after apply)
          + preference     = 10
          + status         = "enable"
          + ttl            = 86400
          + type           = "PTR"
        }
      + dns_entry {
          + hostname   = "example"
          + id         = (known after apply)
          + ip         = "192.168.1.10"
          + ipv6       = (known after apply)
          + preference = (known after apply)
          + status     = "enable"
          + ttl        = 3600
          + type       = "A"
        }
      + dns_entry {
          + hostname   = "test"
          + id         = (known after apply)
          + ip         = "192.168.1.11"
          + ipv6       = (known after apply)
          + preference = (known after apply)
          + status     = "enable"
          + ttl        = 3600
          + type       = "NS"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
fortios_system_dnsdatabase.trname: Creating...
╷
│ Error: Error creating SystemDnsDatabase resource: Internal Server Error - Internal error when processing the request (500)
│ 
│   with fortios_system_dnsdatabase.trname,
│   on 05_dns_server_lan.tf line 1, in resource "fortios_system_dnsdatabase" "trname":
│    1: resource "fortios_system_dnsdatabase" "trname" {
│ `